results/0050-cache-summary.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: har-test-script.js

    duration: -, iterations: -
         vus: 1, max: 50

    init [----------------------------------------------------------] starting
    █ page_1 - https://test.devopsdirective.com/posts/2020/03/always-on-minikube/

      ✓ http2 is used
      ✓ status is 200
      ✓ content is present

    check_failure_rate.........: 0.00%   ✓ 0    ✗ 2886
    checks.....................: 100.00% ✓ 8658 ✗ 0   
    data_received..............: 1.4 GB  69 MB/s
    data_sent..................: 4.5 MB  223 kB/s
    group_duration.............: avg=173.09ms min=145.27ms med=163.7ms  max=489.63ms p(90)=202.6ms  p(95)=226.2ms 
    http_req_blocked...........: avg=43.95µs  min=143ns    med=359ns    max=147.35ms p(90)=629ns    p(95)=907ns   
    http_req_connecting........: avg=17.86µs  min=0s       med=0s       max=20.97ms  p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=25.86ms  min=11.53ms  med=21.75ms  max=350.91ms p(90)=38.43ms  p(95)=47.48ms 
    http_req_receiving.........: avg=835.96µs min=41.84µs  med=231.95µs max=42.42ms  p(90)=2.2ms    p(95)=2.9ms   
    http_req_sending...........: avg=39.71µs  min=10.73µs  med=38.12µs  max=4.1ms    p(90)=56.56µs  p(95)=65.12µs 
    http_req_tls_handshaking...: avg=23.39µs  min=0s       med=0s       max=77.24ms  p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=24.98ms  min=11.37ms  med=21.04ms  max=350.8ms  p(90)=37.01ms  p(95)=45.34ms 
    http_reqs..................: 34748   1736.544599/s
    iteration_duration.........: avg=173.14ms min=145.31ms med=163.76ms max=489.67ms p(90)=202.72ms p(95)=226.23ms
    iterations.................: 2862    143.029545/s
    vus........................: 49      min=3  max=49
    vus_max....................: 50      min=50 max=50